{"class_name": "Model", "config": {"name": "model_6", "layers": [{"name": "input_11", "class_name": "InputLayer", "config": {"batch_input_shape": [32, 6000, 8, 1], "dtype": "float32", "sparse": false, "name": "input_11"}, "inbound_nodes": []}, {"name": "input_12", "class_name": "InputLayer", "config": {"batch_input_shape": [32, 20, 205, 8], "dtype": "float32", "sparse": false, "name": "input_12"}, "inbound_nodes": []}, {"name": "sequential_11", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"name": "conv2d_26", "trainable": true, "batch_input_shape": [32, 6000, 8, 1], "dtype": "float32", "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_16", "trainable": true, "pool_size": [2, 1], "padding": "valid", "strides": [2, 1], "data_format": "channels_last"}}, {"class_name": "Activation", "config": {"name": "activation_26", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_36", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_27", "trainable": true, "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_17", "trainable": true, "pool_size": [2, 1], "padding": "valid", "strides": [2, 1], "data_format": "channels_last"}}, {"class_name": "Activation", "config": {"name": "activation_27", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_37", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_28", "trainable": true, "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_18", "trainable": true, "pool_size": [2, 1], "padding": "valid", "strides": [2, 1], "data_format": "channels_last"}}, {"class_name": "Activation", "config": {"name": "activation_28", "trainable": true, "activation": "relu"}}, {"class_name": "Reshape", "config": {"name": "reshape_11", "trainable": true, "target_shape": [20, -1]}}, {"class_name": "Dropout", "config": {"name": "dropout_38", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}}], "inbound_nodes": [[["input_11", 0, 0, {}]]]}, {"name": "sequential_12", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"name": "conv2d_29", "trainable": true, "batch_input_shape": [32, 20, 205, 8], "dtype": "float32", "filters": 8, "kernel_size": [2, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_29", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_39", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_30", "trainable": true, "filters": 8, "kernel_size": [2, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_30", "trainable": true, "activation": "relu"}}, {"class_name": "Reshape", "config": {"name": "reshape_12", "trainable": true, "target_shape": [20, 1640]}}, {"class_name": "Dropout", "config": {"name": "dropout_40", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}}], "inbound_nodes": [[["input_12", 0, 0, {}]]]}, {"name": "concatenate_6", "class_name": "Concatenate", "config": {"name": "concatenate_6", "trainable": true, "axis": 2}, "inbound_nodes": [[["sequential_11", 1, 0, {}], ["sequential_12", 1, 0, {}]]]}, {"name": "lstm_11", "class_name": "LSTM", "config": {"name": "lstm_11", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 48, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["concatenate_6", 0, 0, {}]]]}, {"name": "dropout_41", "class_name": "Dropout", "config": {"name": "dropout_41", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["lstm_11", 0, 0, {}]]]}, {"name": "lstm_12", "class_name": "LSTM", "config": {"name": "lstm_12", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 48, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["dropout_41", 0, 0, {}]]]}, {"name": "dropout_42", "class_name": "Dropout", "config": {"name": "dropout_42", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["lstm_12", 0, 0, {}]]]}, {"name": "time_distributed_6", "class_name": "TimeDistributed", "config": {"name": "time_distributed_6", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["dropout_42", 0, 0, {}]]]}], "input_layers": [["input_11", 0, 0], ["input_12", 0, 0]], "output_layers": [["time_distributed_6", 0, 0]]}, "keras_version": "2.1.2", "backend": "tensorflow"}